{
  "days": [
    { "day": 1, "tasks": [
      "Write down three signs you feel burnout.",
      "Take a 10-minute silent break without your phone.",
      "Walk outside for 15 minutes.",
      "Say “no” to one small request today.",
      "Text someone who gives you positive energy.",
      "Before bed, write one pleasant moment from today."
    ]},
    { "day": 2, "tasks": [
      "Identify one task you can postpone or simplify.",
      "Practice “box breathing” (4-4-4-4) for 5 minutes.",
      "Do 10 minutes of light stretching.",
      "Spend 30 minutes without social media.",
      "Call a friend and talk about anything but work.",
      "Journal: “What gives me energy right now?”"
    ]},
    { "day": 3, "tasks": [
      "Write down three things you could delegate this week.",
      "Listen to music mindfully for 15 minutes.",
      "Prepare a balanced meal with protein and vegetables.",
      "Go for a mindful walk, noticing what you see and hear.",
      "Thank someone today (in person or message).",
      "Journal: “Two things I can do for myself tomorrow.”"
    ]},
    { "day": 4, "tasks": [
      "Start the morning with a glass of water and 5 deep breaths.",
      "Reduce multitasking: focus on one thing for 20 minutes.",
      "Take a 15-minute break outdoors.",
      "Write down one boundary you need at work/study.",
      "Spend 15 minutes doing something creative (drawing, writing, etc.).",
      "Before bed, reflect: “What drained me most today?”"
    ]},
    { "day": 5, "tasks": [
      "Journal three emotions you felt today.",
      "Try a 10-minute guided meditation.",
      "Do light physical activity for 20 minutes.",
      "Say “no” twice today — politely but firmly.",
      "Meet someone for coffee or a short chat.",
      "Read 5 pages from one of your ADVICE books."
    ]},
    { "day": 6, "tasks": [
      "Start the day without checking your phone for 30 minutes.",
      "Write down one thing you are grateful for.",
      "Spend 20 minutes in sunlight or fresh air.",
      "Declutter one small area (desk, bag, folder).",
      "Share honestly with a friend how you are feeling.",
      "Before sleep, list three things you managed to do today."
    ]},
    { "day": 7, "tasks": [
      "Journal: “What makes me feel alive?”",
      "Practice breathing: inhale 4, hold 7, exhale 8 (5 times).",
      "Cook or prepare a healthy meal for yourself.",
      "Take a 30-minute walk without music or phone.",
      "Write one supportive message to a colleague/friend.",
      "Read 10 pages from your ADVICE books."
    ]},
    { "day": 8, "tasks": [
      "Plan your day with only 3 key tasks.",
      "Do a 15-minute body scan relaxation.",
      "Journal: “Which activities exhaust me most?”",
      "Spend 1 hour without screens today.",
      "Schedule a small joy (movie, bath, tea).",
      "Read 15 minutes from one of your ADVICE books."
    ]},
    { "day": 9, "tasks": [
      "Start with stretching and 5 deep breaths.",
      "Write a letter to yourself from a kind friend’s perspective.",
      "Go outside and notice 5 things you see, 4 hear, 3 feel, 2 smell, 1 taste.",
      "Set a clear work/study end time and stick to it.",
      "Talk to someone about a hobby or interest (not work).",
      "Before sleep, read 5 pages from your ADVICE books."
    ]},
    { "day": 10, "tasks": [
      "Journal: “What do I really need right now?”",
      "Practice gratitude for 3 small things.",
      "Do 20 minutes of exercise that feels enjoyable.",
      "Spend 20 minutes reading from one of your ADVICE books.",
      "Write down one unrealistic expectation to let go of.",
      "Share one positive story with a friend/family."
    ]},
    { "day": 11, "tasks": [
      "Drink water before morning coffee/tea.",
      "Write your top 3 priorities in life.",
      "Try 10 minutes of progressive muscle relaxation.",
      "Set a boundary: log off work/study at a fixed time.",
      "Send a voice message or call to connect more personally.",
      "Journal: “What small success did I have today?”"
    ]},
    { "day": 12, "tasks": [
      "Begin the day with 5 minutes of quiet reflection.",
      "Write down one fear about burnout.",
      "Move your body for 25 minutes (walk, yoga, dance).",
      "Have one conversation without rushing.",
      "Avoid social media for 2 hours today.",
      "Before bed, write one thing that made you smile."
    ]},
    { "day": 13, "tasks": [
      "Write 5 positive words that describe you.",
      "Practice “square breathing” 10 times.",
      "Cook a meal and eat slowly, noticing flavors.",
      "Say “no” to an unnecessary task today.",
      "Share one funny video/meme with a friend.",
      "Journal: “What would life look like with less burnout?”"
    ]},
    { "day": 14, "tasks": [
      "Morning gratitude: list 3 people who support you.",
      "Go for a 30-minute nature walk.",
      "Reflect: “Where do I need stronger boundaries?”",
      "Spend 15 minutes doing art, music, or writing.",
      "Talk honestly about burnout with a trusted person.",
      "Read 5 pages from one of your ADVICE books."
    ]},
    { "day": 15, "tasks": [
      "Begin the day with gentle stretching and calm breathing.",
      "Journal: “What habits add to my stress?”",
      "Do 30 minutes of enjoyable movement.",
      "Try a new relaxing activity (meditation app, bath, journaling).",
      "Spend 1 hour in nature if possible.",
      "Before bed, write: “3 things I released today.”"
    ]},
    { "day": 16, "tasks": [
      "Start with water and 10 mindful breaths.",
      "Reflect on your week: what restored your energy most?",
      "Declutter one bigger space (closet, room corner).",
      "Practice saying “I can’t do this right now” once today.",
      "Write a supportive note to yourself.",
      "Journal: “What would a balanced day look like for me?”"
    ]},
    { "day": 17, "tasks": [
      "Do 15 minutes of yoga or mindful stretching.",
      "Journal 5 warning signs of burnout you’ve noticed.",
      "Schedule a fun break in the middle of the day.",
      "Share gratitude with someone out loud.",
      "Read 10 pages from one of your ADVICE books.",
      "Before bed, write: “What gave me hope today?”"
    ]},
    { "day": 18, "tasks": [
      "Start the day without your phone for 1 hour.",
      "Journal: “What values matter most to me?”",
      "Move your body for 30 minutes.",
      "Limit work/study to essential tasks only.",
      "Connect deeply with one person (call/meet).",
      "Write down one dream you still want to pursue."
    ]},
    { "day": 19, "tasks": [
      "Write 3 things you are learning through burnout.",
      "Practice mindful breathing for 10 minutes.",
      "Walk for 40 minutes in nature.",
      "Say “no” to something bigger today (meeting, task).",
      "Journal: “What would self-compassion look like right now?”",
      "Do one creative task before sleep."
    ]},
    { "day": 20, "tasks": [
      "Journal: “What energizes me vs. drains me?”",
      "Plan your day with rest breaks included.",
      "Exercise for 30 minutes.",
      "Spend 2 hours without screens/social media.",
      "Share an honest reflection with a friend.",
      "Read 15 minutes from one of your ADVICE books."
    ]},
    { "day": 21, "tasks": [
      "Reflect: “What progress have I made in 3 weeks?”",
      "Write 3 affirmations: “I deserve rest,” etc.",
      "Do a longer activity you enjoy (60 minutes walk, sport, art).",
      "Journal: “What boundaries have helped me most?”",
      "Call someone and talk openly about your struggles.",
      "Write: “What am I proud of myself for this week?”"
    ]},
    { "day": 22, "tasks": [
      "Begin the day with meditation (10 min).",
      "Journal: “What stressors can I remove from my routine?”",
      "Move your body for 40 minutes.",
      "Plan a joyful activity for this week.",
      "Share a positive experience with someone.",
      "Read 5 pages from your ADVICE books."
    ]},
    { "day": 23, "tasks": [
      "Practice deep breathing for 15 minutes.",
      "Write down three things you will not sacrifice for work.",
      "Declutter your digital space (emails, apps).",
      "Spend 1 hour in nature.",
      "Talk with someone about hopes/dreams.",
      "Reflect: “What makes me feel stronger now than before?”"
    ]},
    { "day": 24, "tasks": [
      "Journal: “What lessons has burnout taught me?”",
      "Create a small vision board or list of future goals.",
      "Move your body for 45 minutes.",
      "Cook a healthy meal from scratch.",
      "Spend time with someone supportive.",
      "Read 10 pages from one of your ADVICE books."
    ]},
    { "day": 25, "tasks": [
      "Reflect: “What do I want more of in my life?”",
      "Try a new relaxation practice (tai chi, mindfulness, journaling).",
      "Do 20 minutes of exercise + stretching.",
      "Limit phone use to essential tasks today.",
      "Share one piece of wisdom with someone else.",
      "Journal: “What does recovery mean to me?”"
    ]},
    { "day": 26, "tasks": [
      "Write 5 ways you will protect your energy next month.",
      "Meditate for 15 minutes.",
      "Move your body for 45 minutes.",
      "Write 3 people you want to spend more time with.",
      "Express gratitude directly to one person today.",
      "Read 15 minutes from one of your ADVICE books."
    ]},
    { "day": 27, "tasks": [
      "Journal: “What parts of my burnout story can I let go of?”",
      "Practice longer box breathing (10 minutes).",
      "Plan your day around rest first, then tasks.",
      "Spend quality time with loved ones.",
      "Engage in a creative hobby for 30 minutes.",
      "Write: “What is my intention for tomorrow?”"
    ]},
    { "day": 28, "tasks": [
      "Begin the day with affirmations: “I am worthy of peace.”",
      "Journal: “What inspires me deeply?”",
      "Exercise 45 minutes.",
      "Take a 2-hour break from all screens.",
      "Talk to a trusted person about your growth.",
      "Read 10 pages from one of your ADVICE books."
    ]},
    { "day": 29, "tasks": [
      "Write down the 3 biggest changes you notice in yourself.",
      "Meditate or breathe deeply for 20 minutes.",
      "Walk for 60 minutes outdoors.",
      "Journal: “What boundaries will I keep long-term?”",
      "Share your progress with a supportive friend.",
      "Write a letter to your future self."
    ]},
    { "day": 30, "tasks": [
      "Morning reflection: “How have I changed in 30 days?”",
      "Write 5 affirmations of strength and balance.",
      "Do your favorite form of movement for 45–60 minutes.",
      "Spend joyful time with someone close.",
      "Journal: “What is my long-term vision for a balanced life?”",
      "Celebrate your progress with a treat or activity you love."
    ]}
  ]
}
